[Killed] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-       
-        this._distribution = new Map();
-        for (let i = 1; i <= faces; i++) {
-            this._distribution.set(i, 0);
-        }
-
-        this._last = 0;
-        this._faces = faces;
-
-        if(faces < 2)
-        {
-            this._faces = 6;
-        }
-        if(faces < 0)
-        {
-            this._faces = 6;
-        }
-    }
+    constructor(faces: number) {}
 
     get faces(): number {
killedBy: Constructor test cases die have atleast 2 faces 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: undefined

[Killed] BlockStatement
src/Roller.ts:12:42
     constructor(faces: number) {
        
         this._distribution = new Map();
-        for (let i = 1; i <= faces; i++) {
-            this._distribution.set(i, 0);
-        }
+        for (let i = 1; i <= faces; i++) {}
 
         this._last = 0;
killedBy: destribution function  check whether returns correct value 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] ConditionalExpression
src/Roller.ts:12:25
     constructor(faces: number) {
        
         this._distribution = new Map();
-        for (let i = 1; i <= faces; i++) {
+        for (let i = 1; false; i++) {
             this._distribution.set(i, 0);
         }
killedBy: destribution function  check whether returns correct value 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] EqualityOperator
src/Roller.ts:19:12
         this._last = 0;
         this._faces = faces;
 
-        if(faces < 2)
+        if(faces >= 2)
         {
             this._faces = 6;
killedBy: Constructor test cases die have atleast 2 faces 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] ConditionalExpression
src/Roller.ts:19:12
         this._last = 0;
         this._faces = faces;
 
-        if(faces < 2)
+        if(true)
         {
             this._faces = 6;
killedBy: Constructor test cases check whether it set faces to correct value 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 6

[Killed] BlockStatement
src/Roller.ts:20:9
         this._faces = faces;
 
         if(faces < 2)
-        {
-            this._faces = 6;
-        }
+        {}
         if(faces < 0)
         {
killedBy: Constructor test cases die have atleast 2 faces 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 6
Received: 1

[Killed] ConditionalExpression
src/Roller.ts:23:12
         {
             this._faces = 6;
         }
-        if(faces < 0)
+        if(true)
         {
             this._faces = 6;
killedBy: Constructor test cases check whether it set faces to correct value 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 6

[Killed] EqualityOperator
src/Roller.ts:23:12
         {
             this._faces = 6;
         }
-        if(faces < 0)
+        if(faces >= 0)
         {
             this._faces = 6;
killedBy: Constructor test cases check whether it set faces to correct value 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: 6

[Survived] BlockStatement
src/Roller.ts:24:9
             this._faces = 6;
         }
         if(faces < 0)
-        {
-            this._faces = 6;
-        }
+        {}
     }
 

[Killed] BlockStatement
src/Roller.ts:43:32
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number{
-        if (value < 1 || value > this._faces) {
-            return 0;
-        }
-
-        this._last = value;
-        this._distribution.set(value, this._distribution.get(value) + 1);
-
-        return value;
-    }
+    roll(value: number): number{}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: For roll function it return 0 if value is less than 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined
